<template>
  <div class="main">
    <PageHeader back title="使用说明" />
    <div class="document">

      <h1>使用说明</h1>
      <p>（也可以参见作品提交目录的使用说明）</p>
      <h2>1. 进度</h2>
      <hr/>
      <p>进度是记录某件事情完成总进度的值，没有每日记录限制，只有当总计数达到设定的总量时即结束，例如您要记录电视剧观看具体集数就可以创建进度来记录
      创建进度时候分为递增进度，递减进度，总进度三类</p>
      <p><strong>递增进度</strong>：进度从0开始您点击 + 后每次增加，直到您设定的总量</p>
      <p><strong>递减进度</strong>：进度从设定的总量开始，您点击 - 后每次减少，直到减到0</p>
      <p><strong>总进度</strong>：当您有多个进度任务时，可以创建一个总进度，然后在总进度里创建子进度，总进度会汇总所有的进度进行显示</p>
      <p><strong>总量</strong>：即进度的总量</p>
      <p><strong>单位</strong>：进度的计量单位。例如您要记录电视剧进度，总量填写10，单位填 ‘集’则进度描述为10集</p>
      <p><strong>增量</strong>：每次点击+或-会增加或减去所填的指定量。例如增量填写2，则每次点击加号进度+2</p>
      <h2>2. 计数</h2>
      <hr/>
      <p>计数是为了统计一件事情所做次数，无每日计数以及总计数上限，不想记录手动归档即可</p>
      <p><strong>每日</strong>：即统计每日的计数</p>
      <p><strong>每周</strong>：即统计每周的计数</p>
      <p><strong>每月</strong>：即统计每月的计数</p>
      <p><strong>单位</strong>：计数的计量单位。例如您要记录上班迟到次数，单位填 ‘次’，您本月迟到5次</p>
      <p><strong>增量</strong>：每次点击加号或减号计数会增加或减去所填的指定量。例如增量填写2，则每次点击加号计数+2</p>
      <h2>3. 目标</h2>
      <hr/>
      <p>目标是记录每天指定数量的打卡，当天打卡数量达到您设定的值，会打钩视为当天目标完成，相应的目标达成天数会+1，（为了满足每日目标超额完成的需求，打钩后的目标可以继续点击打卡，当然如果不需要的超额的小伙伴不要去继续点击打卡，如果误打卡，可以长按打卡按钮撤回）</p>
      <p>目标分为单次，循环两个类型</p>
      <p><strong>单次</strong>：即一次性目标，当设定的目标天数达成后视为本次创建的目标完成</p>
      <p><strong>循环</strong>：目标无结束时间，可无限执行下去</p>
      <p><strong>固定</strong>：默认周一到周日每天开放目标，也可选择指定哪一天开放目标，而非指定日期目标将锁定无法操作</p>
      <p>目前正在开发每周，每月选项</p>
      <p><strong>目标天数</strong>：达成每日设定数量即为达成一天，直到达成天数到设定天数</p>
      <p><strong>每日数量</strong>：设定一个数量，当天达成指定数量后算为完成</p>
      <p><strong>单位</strong>：每天达成数量的计量单位。例如您要记录每天喝8杯水，单位填 ‘杯’，您今天喝8杯</p>
      <p><strong>增量</strong>：每次点击目标圆圈会增加指定量。例如增量填写2，则每次每天数量+2</p>
      <h2>4. 专注</h2>
      <hr/>
      <p>见《使用说明》</p>
    </div>
  </div>
</template>
<script setup>
import PageHeader from '../../components/PageHeader.vue';
import { RouterLink,useRouter } from 'vue-router';
const router = useRouter()
const aback = ()=>{
  router.go(-1);
}
</script>
<style scoped lang="scss">
</style>


